In [1]:
import numpy as np
import pandas as pd

In [8]:
d1={'USN':[11,12,13,14,15],
  'NAME':['POOJA','DARSHAN','NITISH','SIMRAN','KAILASH'],
  'MOBILE':[23456,48373,34983,87432,38209],
  'MARKS':[40,46,36,39,45]
  }

In [22]:
df1=pd.DataFrame(d1)

In [24]:
df1

   USN     NAME  MOBILE  MARKS
0   11    POOJA   23456     40
1   12  DARSHAN   48373     46
2   13   NITISH   34983     36
3   14   SIMRAN   87432     39
4   15  KAILASH   38209     45

In [14]:
d2={'c1':[2,4,6,5],'c2':[6,3,4,1]}
d3={'c1':[3,5,7,9],'c2':[7,3,1,6]}
d4={'c1':[9,3,1,5],'c2':[2,2,5,7]}

In [25]:
df2=pd.DataFrame(d2)

In [26]:
df2

   c1  c2
0   2   6
1   4   3
2   6   4
3   5   1

In [27]:
pd.concat([df1,df2])

    USN     NAME   MOBILE  MARKS   c1   c2
0  11.0    POOJA  23456.0   40.0  NaN  NaN
1  12.0  DARSHAN  48373.0   46.0  NaN  NaN
2  13.0   NITISH  34983.0   36.0  NaN  NaN
3  14.0   SIMRAN  87432.0   39.0  NaN  NaN
4  15.0  KAILASH  38209.0   45.0  NaN  NaN
0   NaN      NaN      NaN    NaN  2.0  6.0
1   NaN      NaN      NaN    NaN  4.0  3.0
2   NaN      NaN      NaN    NaN  6.0  4.0
3   NaN      NaN      NaN    NaN  5.0  1.0

In [30]:
pd.merge(df1,df2,how='inner', on='c2')

KeyError: 'c1'

In [31]:
#create two dfs using merge, such that with the help two inner joints will return you three rows

In [63]:
d9={'USN':[11,12,13,14,15],'STUDENT NAME':['POOJA','DARSHAN','NITISH','SIMRAN','KAILASH'],
  'MARKS':[40,46,36,39,45]
  }

In [64]:
df=pd.DataFrame(d9)

In [65]:
df

   USN STUDENT NAME  MARKS
0   11        POOJA     40
1   12      DARSHAN     46
2   13       NITISH     36
3   14       SIMRAN     39
4   15      KAILASH     45

In [71]:
d6={'USN':[11],
  'MOBILE':[23456],
  }

In [72]:
df9=pd.DataFrame(d6)

In [73]:
df9

   USN  MOBILE
0   11   23456

In [74]:
pd.merge(df,df9,how='left', on='USN')

   USN STUDENT NAME  MARKS   MOBILE
0   11        POOJA     40  23456.0
1   12      DARSHAN     46      NaN
2   13       NITISH     36      NaN
3   14       SIMRAN     39      NaN
4   15      KAILASH     45      NaN